nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_mcg.h
/*
 * Constants & macros for individual MCG_SC bitfields
 */

/*!
 * @name Register MCG_SC, field FCRDIV[3:1] (RW)
 *
 * Selects the factor value to divide the LIRC source.
 *
 * Values:
 * - 000 - Division factor is 1.
 * - 001 - Division factor is 2.
 * - 010 - Division factor is 4.
 * - 011 - Division factor is 8.
 * - 100 - Division factor is 16.
 * - 101 - Division factor is 32.
 * - 110 - Division factor is 64.
 * - 111 - Division factor is 128.
 */
/*@{*/
#define BP_MCG_SC_FCRDIV     (1U)          /*!< Bit position for MCG_SC_FCRDIV. */
#define BM_MCG_SC_FCRDIV     (0x0EU)       /*!< Bit mask for MCG_SC_FCRDIV. */
#define BS_MCG_SC_FCRDIV     (3U)          /*!< Bit field size in bits for MCG_SC_FCRDIV. */

/*! @brief Read current value of the MCG_SC_FCRDIV field. */
#define BR_MCG_SC_FCRDIV(x)  (BME_UBFX8(HW_MCG_SC_ADDR(x), BP_MCG_SC_FCRDIV, BS_MCG_SC_FCRDIV))

/*! @brief Format value for bitfield MCG_SC_FCRDIV. */
#define BF_MCG_SC_FCRDIV(v)  ((uint8_t)((uint8_t)(v) << BP_MCG_SC_FCRDIV) & BM_MCG_SC_FCRDIV)

/*! @brief Set the FCRDIV field to a new value. */
#define BW_MCG_SC_FCRDIV(x, v) (BME_BFI8(HW_MCG_SC_ADDR(x), ((uint8_t)(v) << BP_MCG_SC_FCRDIV), BP_MCG_SC_FCRDIV, 3))
/*@}*/

/*******************************************************************************
 * HW_MCG_HCTRIM - MCG High-frequency IRC Coarse Trim Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_HCTRIM - MCG High-frequency IRC Coarse Trim Register (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_hctrim
{
    uint8_t U;
    struct _hw_mcg_hctrim_bitfields
    {
        uint8_t COARSE_TRIM : 6;       /*!< [5:0] High-frequency IRC Coarse Trim */
        uint8_t RESERVED0 : 2;         /*!< [7:6]  */
    } B;
} hw_mcg_hctrim_t;

/*!
 * @name Constants and macros for entire MCG_HCTRIM register
 */
/*@{*/
#define HW_MCG_HCTRIM_ADDR(x)    ((x) + 0x14U)

#define HW_MCG_HCTRIM(x)         (*(__I hw_mcg_hctrim_t *) HW_MCG_HCTRIM_ADDR(x))
#define HW_MCG_HCTRIM_RD(x)      (HW_MCG_HCTRIM(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_HCTRIM bitfields
 */

/*!
 * @name Register MCG_HCTRIM, field COARSE_TRIM[5:0] (RO)
 *
 * Loads from a factory programmed location when out of reset.
 */
/*@{*/
#define BP_MCG_HCTRIM_COARSE_TRIM (0U)     /*!< Bit position for MCG_HCTRIM_COARSE_TRIM. */
#define BM_MCG_HCTRIM_COARSE_TRIM (0x3FU)  /*!< Bit mask for MCG_HCTRIM_COARSE_TRIM. */
#define BS_MCG_HCTRIM_COARSE_TRIM (6U)     /*!< Bit field size in bits for MCG_HCTRIM_COARSE_TRIM. */

/*! @brief Read current value of the MCG_HCTRIM_COARSE_TRIM field. */
#define BR_MCG_HCTRIM_COARSE_TRIM(x) (BME_UBFX8(HW_MCG_HCTRIM_ADDR(x), BP_MCG_HCTRIM_COARSE_TRIM, BS_MCG_HCTRIM_COARSE_TRIM))
/*@}*/

/*******************************************************************************
 * HW_MCG_HTTRIM - MCG High-frequency IRC Tempco (Temperature Coefficient) Trim Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_HTTRIM - MCG High-frequency IRC Tempco (Temperature Coefficient) Trim Register (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_httrim
{
    uint8_t U;
    struct _hw_mcg_httrim_bitfields
    {
        uint8_t TEMPCO_TRIM : 5;       /*!< [4:0] High-frequency IRC Tempco Trim */
        uint8_t RESERVED0 : 3;         /*!< [7:5]  */
    } B;
} hw_mcg_httrim_t;

/*!
 * @name Constants and macros for entire MCG_HTTRIM register
 */
/*@{*/
#define HW_MCG_HTTRIM_ADDR(x)    ((x) + 0x15U)

#define HW_MCG_HTTRIM(x)         (*(__I hw_mcg_httrim_t *) HW_MCG_HTTRIM_ADDR(x))
#define HW_MCG_HTTRIM_RD(x)      (HW_MCG_HTTRIM(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_HTTRIM bitfields
 */

/*!
 * @name Register MCG_HTTRIM, field TEMPCO_TRIM[4:0] (RO)
 *
 * Loads from a factory programmed location when out of reset.
 */
/*@{*/
#define BP_MCG_HTTRIM_TEMPCO_TRIM (0U)     /*!< Bit position for MCG_HTTRIM_TEMPCO_TRIM. */
#define BM_MCG_HTTRIM_TEMPCO_TRIM (0x1FU)  /*!< Bit mask for MCG_HTTRIM_TEMPCO_TRIM. */
#define BS_MCG_HTTRIM_TEMPCO_TRIM (5U)     /*!< Bit field size in bits for MCG_HTTRIM_TEMPCO_TRIM. */

/*! @brief Read current value of the MCG_HTTRIM_TEMPCO_TRIM field. */
#define BR_MCG_HTTRIM_TEMPCO_TRIM(x) (BME_UBFX8(HW_MCG_HTTRIM_ADDR(x), BP_MCG_HTTRIM_TEMPCO_TRIM, BS_MCG_HTTRIM_TEMPCO_TRIM))
/*@}*/

/*******************************************************************************
 * HW_MCG_HFTRIM - MCG High-frequency IRC Fine Trim Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_HFTRIM - MCG High-frequency IRC Fine Trim Register (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_hftrim
{
    uint8_t U;
    struct _hw_mcg_hftrim_bitfields
    {
        uint8_t FINE_TRIM : 7;         /*!< [6:0] High-frequency IRC Fine Trim */
        uint8_t RESERVED0 : 1;         /*!< [7]  */
    } B;
} hw_mcg_hftrim_t;

/*!
 * @name Constants and macros for entire MCG_HFTRIM register
 */
/*@{*/
#define HW_MCG_HFTRIM_ADDR(x)    ((x) + 0x16U)

#define HW_MCG_HFTRIM(x)         (*(__I hw_mcg_hftrim_t *) HW_MCG_HFTRIM_ADDR(x))
#define HW_MCG_HFTRIM_RD(x)      (HW_MCG_HFTRIM(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_HFTRIM bitfields
 */

/*!
 * @name Register MCG_HFTRIM, field FINE_TRIM[6:0] (RO)
 *
 * Loads from a factory programmed location when out of reset.
 */
/*@{*/
#define BP_MCG_HFTRIM_FINE_TRIM (0U)       /*!< Bit position for MCG_HFTRIM_FINE_TRIM. */
#define BM_MCG_HFTRIM_FINE_TRIM (0x7FU)    /*!< Bit mask for MCG_HFTRIM_FINE_TRIM. */
#define BS_MCG_HFTRIM_FINE_TRIM (7U)       /*!< Bit field size in bits for MCG_HFTRIM_FINE_TRIM. */

/*! @brief Read current value of the MCG_HFTRIM_FINE_TRIM field. */
#define BR_MCG_HFTRIM_FINE_TRIM(x) (BME_UBFX8(HW_MCG_HFTRIM_ADDR(x), BP_MCG_HFTRIM_FINE_TRIM, BS_MCG_HFTRIM_FINE_TRIM))
/*@}*/

